In [ ]:
import pandas as pd
import numpy as np
from datetime import datetime

In [ ]:
# 1. Read CSV, Change column name in CSV, use some specific columns in CSV
# 2. Summary of the high level metrics
# 3. Read some speicific elemant in CSV, update it and how to use dates for CSV
# 4. Append data to the CSV side by side and at the end of the table
# 5. Sort the data, Group the data, filter the data and unique values in the data
# 6. Pivot the data, Window functions
# 7. Drop duplicates, replace the errors with means, medians
# 8. delete the data from table

In [ ]:
dict_data = {
    'Contract' : ['Contract 1', 'Contract 2', 'Contract 3', 'Contract 4'],
    'Contract_Date': ['01/01/2019', '02/02/2019', '03/03/2019', '04/03/2019'],
    'Delivery' : ['2019-01', '2019-01', '2019-02', '2019-03'],
    'Price' : [90, 95, 100, 105],
    'Balance': [50, 100, 150, 200]
}

tempdf = pd.DataFrame.from_dict(dict_data)

In [ ]:
df = pd.read_csv("wheatData.csv") #Read CSV
#df_sheet1 = pd.read_excel('your_file.xlsx', sheet_name='Sheet1') To read Excel

In [ ]:
# data Summary
df.head(n = 4) #To see the some of the elemants of data fram
df.describe() #To see the metrics like mean median mode associated with a data frame
df.columns #To see the columns in a data datframe
df["A"].head() #Shows the data of a specific column

0    15.26
1    14.88
2    14.29
3    13.84
4    16.14
Name: A, dtype: float64

In [ ]:
df["A"].unique() #Shows the unique value for a column
df["A"].value_counts() #Shows the count of unique values
df["A"].value_counts(sort = True, normalize = False)
df.drop_duplicates() #Remove duplicates from the data frame
df["A"].fillna(df["A"].mean(), inplace = True) #Replace blank values with means
df["A"].replace(15.26, 16.26)
df.set_index("A")
df.reset_index()

,index,A,P,C,LK,WK,A_Coef,LKG,target,tempColumn
0,0,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,0.0,1.0
1,1,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,0.0,1.0
2,2,34.29,14.09,0.9050,5.291,3.337,2.699,4.825,0.0,2.0
3,3,33.84,13.94,0.8955,5.324,3.379,2.259,4.805,0.0,3.0
4,4,36.14,14.99,0.9034,5.658,3.562,1.355,5.175,0.0,4.0
...,...,...,...,...,...,...,...,...,...,...
206,206,31.23,12.88,0.8511,5.140,2.795,4.325,5.003,2.0,206.0
207,207,33.20,13.66,0.8883,5.236,3.232,8.315,5.056,2.0,207.0
208,208,31.84,13.21,0.8521,5.175,2.836,3.598,5.044,2.0,208.0
209,209,32.30,13.34,0.8684,5.243,2.974,5.637,5.063,2.0,209.0
210,0,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,0.0,1.0

In [ ]:
#Access elemants in a data frame
for i in range(len(df["A"])):
    if i == 5:
        break
    print(df.iloc[i]["A"])
print(df.iloc[i][0:5])

15.26
14.88
14.29
13.84
16.14
A     14.3800
P     14.2100
C      0.8951
LK     5.3860
WK     3.3120
Name: 5, dtype: float64

In [ ]:
#Filter elemant in data frame
df[['A', 'P', 'C']] #Filter columns
df.iloc[1:3] #Filter rows
df[(df["A"] > 14.5) & (df["target"] == 0)] #Filter rows basis certiain conditions
df[(df["P"] == 14.84) | (df["LKG"] == 5.175)]
df[df["A"].isin([14.5,5.175])] #To filter out many elemants

        A      P       C     LK     WK  A_Coef    LKG  target
0   15.26  14.84  0.8710  5.763  3.312   2.221  5.220       0
4   16.14  14.99  0.9034  5.658  3.562   1.355  5.175       0
47  14.99  14.56  0.8883  5.570  3.377   2.958  5.175       0

In [ ]:
df.columns

Index(['A', 'P', 'C', 'LK', 'WK', 'A_Coef', 'LKG', 'target'], dtype='object')

In [ ]:

#To convert a column in data from str to date
#pd.to_datetime([field])

#in order to extract year/month from the date, you would need to use apply function

#def convert_date_to_month(x):
#    return x.month

#def convert_date_to_year(x):
#    return x.year

#customersOrders["new_order_purchase_timestamp"] =
#    customersOrders["new_order_purchase_timestamp"].apply(convert_date_to_month)



# Example Series of datetime objects
#timestamps = pd.to_datetime(['2023-10-26 10:30:00', '2024-03-15 14:45:30', '2025-07-01 08:00:15'])
#timestamps = pd.DataFrame(columns = ["Date"],
#                         data = ['2023-10-26 10:30:00', '2024-03-15 14:45:30', '2025-07-01 08:00:15'])
#format_data = "%Y-%m-%d %H:%M:%S"
#print(timestamps)


#def convert_date_format(x):
#    return datetime.strptime(x, format_data)

# Format the datetime objects to time strings (HH:MM:SS)
#time_str = timestamps["Date"].apply(convert_date_format)
#print(time_str)

#def convert_date_month(x):
#    return x.strftime("%B")

# Format the datetime objects to time strings (HH:MM:SS)
#month_str = time_str.apply(convert_date_month)
#print(month_str)

In [ ]:
#Sort a data Frame
df = df.sort_values(["A", "P", "C", "LK"], ascending = [True, True, True, True,])
df.head(n = 4)

         A      P       C     LK     WK  A_Coef    LKG  target
189  10.59  12.41  0.8648  4.899  2.787   4.975  4.794       2
177  10.74  12.73  0.8329  5.145  2.642   4.702  4.963       2
149  10.79  12.93  0.8107  5.317  2.648   5.462  5.194       2
175  10.80  12.57  0.8590  4.981  2.821   4.773  5.063       2

In [ ]:
#Improvise the columns

In [ ]:
tempDf = df.copy();

def increment(arg):
    return arg + 1

#Here the map will create a list and would assign that list to all the elemants of A
df["TempColumns"] = map(increment, df["A"])

#In order to use one elemant for every row we need to use apply function
df["A"] = df["A"].apply(increment)

In [ ]:
#Delete a column

In [ ]:
if "TempColumns" in df.columns:
    df = df.drop("TempColumns", axis = 1)
#For Many columns df.drop ([column1, column2, column3, column 4], axis = 1)

#Delete a row
#Find the index of the required rows and delete the same
index =

if set([1,2,3,4]).issubset(index):
    df = df.drop(index = [1,2,3,4], axis = 0)

#Delete some specific values from dataDrame
_index = df[df["A"].isin([10.59, 10.79])].index
df = df.drop(index = _index, axis = 0)
df.head(n = 4)

   level_0  index      A      P       C     LK     WK  A_Coef    LKG  target
0        0      0  36.26  14.84  0.8710  5.763  3.312   2.221  5.220       0
5        9     13  34.78  14.06  0.8759  5.479  3.156   3.136  4.872       0
6       10     14  34.74  14.05  0.8744  5.482  3.114   2.932  4.825       0
7       11     15  35.59  14.28  0.8993  5.351  3.333   4.185  4.781       0

In [ ]:
#Add a column
df = tempDf.copy()
df["tempColumn"] = [x for x in range(len(df["A"]))]

#Add a row
_data = [x for x in df.iloc[1]]
newDF = pd.DataFrame([_data], columns = df.columns)
df = pd.concat([df, newDf])

#insert a rwo at a specific index
def insert(_df1, _df2, index):
    upperDf = df.iloc[:index-1]
    lowerDf = df.iloc[index:]
    newDf = pd.concat([upperDf, _df2, lowerDf])
    return newDf

df = insert(df, newDf, 1)

#merge another table
#Syntax pd.merge(df, newDf, on = ["column1", "columns2", "columns3", "columns4"], how = "left")
newDf = pd.merge(df, newDf, on = ["target"], how = "left")
newDf.head(n = 4)

,A_x,P_x,C_x,LK_x,WK_x,A_Coef_x,LKG_x,target,tempColumn_x,A_y,P_y,C_y,LK_y,WK_y,A_Coef_y,LKG_y,tempColumn_y
0,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,0.0,1.0,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,1.0
1,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,0.0,1.0,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,1.0
2,34.29,14.09,0.9050,5.291,3.337,2.699,4.825,0.0,2.0,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,1.0
3,33.84,13.94,0.8955,5.324,3.379,2.259,4.805,0.0,3.0,34.88,14.57,0.8811,5.554,3.333,1.018,4.956,1.0

In [ ]:
#Group by Syntax

       A      P       C     LK     WK  A_Coef    LKG  target  tempColumn
0  34.88  14.57  0.8811  5.554  3.333   1.018  4.956     0.0         1.0

In [ ]:
df

         A      P       C     LK     WK  A_Coef    LKG  target  tempColumn
0    34.88  14.57  0.8811  5.554  3.333   1.018  4.956     0.0         1.0
1    34.88  14.57  0.8811  5.554  3.333   1.018  4.956     0.0         1.0
2    34.29  14.09  0.9050  5.291  3.337   2.699  4.825     0.0         2.0
3    33.84  13.94  0.8955  5.324  3.379   2.259  4.805     0.0         3.0
4    36.14  14.99  0.9034  5.658  3.562   1.355  5.175     0.0         4.0
..     ...    ...     ...    ...    ...     ...    ...     ...         ...
206  31.23  12.88  0.8511  5.140  2.795   4.325  5.003     2.0       206.0
207  33.20  13.66  0.8883  5.236  3.232   8.315  5.056     2.0       207.0
208  31.84  13.21  0.8521  5.175  2.836   3.598  5.044     2.0       208.0
209  32.30  13.34  0.8684  5.243  2.974   5.637  5.063     2.0       209.0
0    34.88  14.57  0.8811  5.554  3.333   1.018  4.956     0.0         1.0

[211 rows x 9 columns]

In [ ]:
df.groupby(["target"])["A"].transform(sum)

newDf = df[["target", "A"]]
newDf.groupby(["target"]).sum()

              A
target
0.0     2437.91
1.0     2683.40
2.0     2231.17

In [ ]:
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'C', 'C'],
        'test': ['A', 'B', 'A', 'B', 'A', 'C', 'C'],
        'Value': [10, 15, 12, 18, 14, 20, 22],
        'Quantity': [1, 2, 1, 2, 1, 3, 3]}
df = pd.DataFrame(data)

In [ ]:
#Group by works with aggregations and transformations
#Aggregation produces a new data frame with shape of the results
#Transaformation retains the shape of original data frame and only works on one columns
#Aggregation functions - sum, mean, min, max, median, count(without na), size(with na)
#nunique, first last

In [ ]:
#Syntax df.groupby([column1,2,3,4....])[columns1,2,3,4....].agg([functions1, functions....])
df_temp_summary_table = df.groupby(["Category", "test"])[["Value","Quantity"]].agg(["sum", "mean", "min"])
#The dimension are index and would need to be reset
df_temp_summary_table.reset_index()

  Category test Value           Quantity
                  sum  mean min      sum mean min
0        A    A    36  12.0  10        3    1   1
1        B    B    33  16.5  15        4    2   2
2        C    C    42  21.0  20        6    3   3

In [ ]:
#df.groupby([column1, column2, column3, column 4])[have only one column].transform("have only one function")

In [ ]:
df["transforms_temp_sum_column"] = df.groupby(["Category", "Quantity"])["Value"].transform("sum")
df["transforms_temp_sum_column"]

0    36
1    33
2    36
3    33
4    36
5    42
6    42
Name: transforms_temp_sum_column, dtype: int64

In [ ]:
#Row numbers
new_data.groupby(["Contract"])["Price"].transform("cumcount")
new_data.groupby(["Contract"])["Price"].transform((lambda x: x.rank(method = "dense")))

In [ ]:
#Calculate the percentage across category
df["Value"]/df.groupby(["Category"])["Value"].transform("sum")

#Calulate the percentage across entire table
df["Value"]/df["Value"].sum()

0    0.090090
1    0.135135
2    0.108108
3    0.162162
4    0.126126
5    0.180180
6    0.198198
Name: Value, dtype: float64

In [ ]:
# How to normalise data with transforms

# Min-Max Normalization
def min_max_scaler(x):
    return (x - x.min()) / (x.max() - x.min())

def z_score_scaler(x):
    return (x - x.mean()) / x.std()

def log_scaler(x):
    return np.log(x)

df["NormalisedContractRenewalByAccount"] = df.groupby("AccountWeeks")["ContractRenewal"].transform(min_max_scaler)

In [ ]:
#Window Functions are to be used with window functions

In [ ]:
df

  Category test  Value  Quantity  transforms_temp_sum_column
0        A    A     10         1                          36
1        B    B     15         2                          33
2        A    A     12         1                          36
3        B    B     18         2                          33
4        A    A     14         1                          36
5        C    C     20         3                          42
6        C    C     22         3                          42

In [ ]:
df.groupby("Category")["Value"].transform(lambda x: x.rolling(window = 3).count())

0    1
1    1
2    2
3    2
4    3
5    1
6    2
Name: Value, dtype: int64

In [ ]:
temp = pd.DataFrame({"category": df["Category"],
 "rolls":df.groupby("Category")["Value"].transform(lambda x: x.rolling(window = 3).count())})
temp.sort_values(by = ["category"], ascending = [True])

  category  rolls
0        A      1
2        A      2
4        A      3
1        B      1
3        B      2
5        C      1
6        C      2

In [ ]:
df["Category"].value_counts()

A    3
C    2
B    2
Name: Category, dtype: int64

In [ ]:
data = {'A': [1, 2, 3],
        'B': ['a', 'b', 'c']}
df = pd.DataFrame(data)

# Convert column 'A' to string
df['C'] = str(df['A'] + 1)
df['A'] = (df['A'] + 1).astype(str)
df

df['D'] = df['A'].astype(str) + df["B"]
df

   A  B                                              C   D
0  2  a  0    2\n1    3\n2    4\nName: A, dtype: int64  2a
1  3  b  0    2\n1    3\n2    4\nName: A, dtype: int64  3b
2  4  c  0    2\n1    3\n2    4\nName: A, dtype: int64  4c

In [ ]:
#in order to read from a speicific tab in excel

#pd.read_excel('file', sheet_name = 'sheet name')

In [ ]:
import pandas as pd

In [ ]:
indx = input()
people = []
for i in range(0, int(indx)):
    people.append(input())

3
Mike Thomson 20 M
Robert Bustle 32 M
Andria Bustle 30 F

In [ ]:
df = pd.DataFrame({
    "first_name": [x.split(' ')[0] for x in people],
    "last_name": [x.split(' ')[1] for x in people],
    "age": [x.split(' ')[2] for x in people],
    "sex": [x.split(' ')[3] for x in people]
})

In [ ]:
df["age"] = df["age"].astype(int)
df.sort_values(["age"], ascending = [True])

  first_name last_name  age sex
0       Mike   Thomson   20   M
2     Andria    Bustle   30   F
1     Robert    Bustle   32   M

In [ ]:
df["salu"] = ''
for i in range(len(df["sex"])):
    if df["sex"][i] == "M":
        df["salu"][i] = "Mr."
    else:
        df["salu"][i] = "Mrs."

<ipython-input-39-4f41816c37d0>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["salu"][i] = "Mr."
<ipython-input-39-4f41816c37d0>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["salu"][i] = "Mrs."

In [ ]:
df

  first_name last_name  age sex  salu
0       Mike   Thomson   20   M   Mr.
1     Robert    Bustle   32   M   Mr.
2     Andria    Bustle   30   F  Mrs.

In [ ]:
str = ""
for i in range(len(df["sex"])):
    str = df["salu"][i] + " " + df["first_name"][i] + " " + df["last_name"][i] + "\n" + str

In [ ]:
print(str)

Mrs. Andria Bustle
Mr. Robert Bustle
Mr. Mike Thomson

0